<!DOCTYPE html>
<html lang="fr">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="style.css">
    <script src="https://cdn.jsdelivr.net/npm/smooth-scroll@16.1.3/dist/smooth-scroll.polyfills.min.js"></script>
    <script src="./script.js" defer></script>
    <title>Nathan Boga</title>
</head>
<body>
    <div id="loadingScreen">
        <h1>Chargement</h1>
        <div id="loadingBar"></div>
    </div>
    <header>
        <section class="left">
            <div class="imageWrapper">
                <img id="profilePicture" src="./img/profilePicture.jpeg" alt="">
            </div>
            <div class="nameWrapper">
                <h1>Nathan</h1>
                <h1>Boga</h1>
            </div>
        </section>
        <section class="middle">
            <nav>
                <ul>
                    <li class="navColor">Accueil</li>
                    <li class="navColor">Expériences</li>
                    <li class="navColor">Comp&eacute;tences</li>
                    <li class="navColor">Projets</li>
                </ul>
            </nav>
        </section>
        <section class="right socials">
            <a href="https://www.github.com/Slysoks/" target="_blank" title="GitHub" class="github"><img src="./img/github.svg" alt="GitHub"></a>
            <a href="https://www.instagram.com/nathan_bga/" target="_blank" title="Instagram"><img src="./img/instagram.png" alt=""></a>
            <a href="https://replit.com/@NathanBoga/" target="_blank" title="Replit"><img src="./img/replit.svg" alt=""></a>
            <a href="https://www.linkedin.com/in/nathan-boga-161a78316/" target="_blank" title="LinkedIn"><img src="./img/linkedin.svg" alt=""></a>
        </section>
    </header>
    <main>
        <section id="presentation">
            <section>
                <div>
                    <div class="imageWrapper">
                        <img src="./img/profilePicture.jpeg" alt="">
                    </div>
                    <div>
                        <h2>Nathan Boga</h2>
                        <p style="text-indent: 30px; margin-top: 15px;">
                            N&eacute; le 15 Mars 2009 &agrave; Saint-Gr&eacute;goire, Nathan Boga est un jeune &eacute;tudiant de
                            <span id="age"></span> ans. Il aime le sport, principalement le tennis, les jeux vid&eacute;os en tout
                            genre et la programmation. Il est actuellement en 1&egrave;re g&eacute;n&eacute;rale au lyc&eacute;e
                            Joliot-Curie de Rennes. Nathan est passionn&eacute; par le num&eacute;rique depuis son plus jeune
                            &acirc;ge et a d&eacute;cid&eacute; de se lancer principalement dans le d&eacute;veloppement web en 2021
                            (5&egrave;me). Il m&eacute;trise aujourd'hui 6 langages de programmation. Il m&eacute;trise &eacute;galement
                            les commandes de base de Linux et Windows. Il &agrave; d&eacute;j&agrave; fait plusieurs stages
                            d&apos;observation dans des entreprises informatiques. Il a &eacute;galement r&eacute;alis&eacute;
                            quelques projets personnels et publics, dont ce porfolio fait en HTML pure.
                        </p>
                    </div>
                </div>
            </section>
            <div>
                <p>
                    <b>&#8220;</b>&nbsp;La victoire appartient au plus opin&acirc;tre.&nbsp;<b>&#8221;</b>
                    Roland Garros
                </p>
            </div>
        </section>
        <section id="experiences">
            <section class="left">
                <a href="https://www.linaia.com/index.html" target="_blank"><h2>Linaïa</h2></a>
                <div>
                    <p>
                        Linaïa est une entreprise de d&eacute;veloppement web et mobile. J&apos;ai effectu&eacute; un stage
                        d&apos;observation de 5 jours dans cette entreprise. J&apos;ai pu voir comment fonctionne une entreprise
                        informatique, comment se d&eacute;roule un projet. C&apos;&eacute;tait une exp&eacute;rience tr&egrave;s
                        enrichissante du fait que j&apos;ai pu comprendre comment les entreprises fonctionnent et comment elles
                        structurent leurs projets. Ce stage a eu lieu du lundi 6 au vendredi 10 F&eacute;vrier
                        2023. J&apos;&eacute;tais alors en 3&egrave;me.
                    </p>
                    <p>
                        Ce n&apos;est toujours qu&apos;une startup, mais elle comporte tout de m&ecirc;me quatorze employ&eacute;s.
                        Ils travaillent avec React, React Native, MongoDB, Laravel. Ils utilisent principalement GitLab pour
                        g&eacute;rer leurs projets. J&apos;ai pu voir comment fonctionne une &eacute;quipe de d&eacute;veloppeurs, comment
                        ils se r&eacute;partissent les t&acirc;ches, comment ils communiquent entre eux. J&apos;ai pu assister
                        &agrave; une r&eacute;union de projet.
                    </p>
                    <p>
                        C&apos;est ici que j&apos;ai appris &agrave; utiliser <b>Git</b>&nbsp;et <b>GitHub</b>, deux outils tr&egrave;s importants pour
                        tout projet. J&apos;ai appris l&apos;utilit&eacute; de <b>Docker</b>.
                    </p>
                </div>
            </section>
            <section class="right">
                <a href="https://www.orange-business.com/fr" target="_blank"><h2>Orange Business</h2></a>
                <div>
                    <p>
                        Orange Business (anciennement Orange Business Services) est une entreprise de t&eacute;l&eacute;communication
                        et de services informatiques. Ils travaillent avec des entreprises pour leur fournir des services tels
                        que le <b>t&eacute;l&eacute;phone</b>, <b>internet</b>, la <b>cybers&eacute;curit&eacute;</b>, etc. J&apos;ai pu voir comment fonctionne une entreprise                        &agrave; grande &eacute;chelle, comment se d&eacute;roule un projet. C&apos;&eacute;tait une exp&eacute;rience
                        &agrave; ne pas rater. Ce stage m&apos;a ouvert le monde du fonctionnement d&apos;internet &agrave;
                        l&apos;&eacute;chelle nationale, voir mondiale avec par exemple, le protocole BGP.
                    </p>
                    <p>
                        Ce stage &agrave; eut lieu du lundi 17 au vendredi 28 juin 2024. J&apos;&eacute;tais alors en 2nde.
                        J&apos;ai pu voir comment fonctionne un routeur (Cisco / Juniper) dans son ensemblle, &agrave; quel niveau il intervient et
                        comment ils fonctionnent globalement.
                    </p>
                    <p>
                        Mais dans tout cela, j&apos;ai eut la chance de rencontrer Dorian, un employ&eacute; de <b>pentest</b>. Dorian m&apos;a
                        montr&eacute; comment fonctionne un pentest.
                    </p>
                </div>
            </section>
        </section>
        <section id="competences">
            <div>
                <section class="left">
                    <h2>Langages de programmation</h2>
                    <div id="html">
                        <h3><span>HTML + CSS</span><span class="percentageValue">85%</span></h3>
                        <div><div class="percentageBar"></div></div>
                    </div>
                    <div id="js">
                        <h3><span>JavaScript</span><span class="percentageValue">50%</span></h3>
                        <div><div class="percentageBar"></div></div>
                    </div>
                    <div id="sql">
                        <h3><span>SQL</span><span class="percentageValue">30%</span></h3>
                        <div><div class="percentageBar"></div></div>
                    </div>
                    <div id="python">
                        <h3><span>Python</span><span class="percentageValue">75%</span></h3>
                        <div><div class="percentageBar"></div></div>
                    </div>
                    <div id="java">
                        <h3><span>Java</span><span class="percentageValue">60%</span></h3>
                        <div><div class="percentageBar"></div></div>
                    </div>
                </section>
                <hr>
                <section class="right">
                    <h2>Autres</h2>
                    <div>
                        <h3><span>Git</span><span class="percentageValue">30%</span></h3>
                        <div><div class="percentageBar"></div></div>
                    </div>
                    <div>
                        <h3><span>Docker</span><span class="percentageValue">10%</span></h3>
                        <div><div class="percentageBar"></div></div>
                    </div>
                    <div>
                        <h3><span>Linux (CLI)</span><span class="percentageValue">30%</span></h3>
                        <div><div class="percentageBar"></div></div>
                    </div>
                    <div>
                        <h3><span>Windows (CLI)</span><span class="percentageValue">50%</span></h3>
                        <div><div class="percentageBar"></div></div>
                    </div>
                    <div>
                        <h3><span>Vite + React</span><span class="percentageValue">25%</span></h3>
                        <div><div class="percentageBar"></div></div>
                    </div>
                </section>
            </div>
        </section>
        <section id="projets">
            <div class="siteweb">
                <h2>Un site web pour ma classe</h2>
                <div>
                    <h3 class="langages">
                        Ce site web &eacute;trait produit en PHP ainsi qu&apos;avec du HTML pure.
                    </h3>
                    <p>
                        Dans le cadre d&apos;un projet personnel, j&apos;ai cr&eacute;&eacute; un site web pour ma classe de 3&egrave;me.
                        Aujourd&apos;hui, le site n&apos;est malheureusement plus en ligne, mais il &eacute;tait possible de
                        discuter dans un chat en ligne, bien &eacute;videment &agrave; condition d&apos;&ecirc;tre connect&eacute;.
                    </p>
                    <p>
                        Ce site contenait une partie <b>utilisateur</b> et une partie <b>administrateur</b>.
                        La partie utilisateur permettait de discuter dans un chat en ligne, de voir les photos et l&apos;emplois
                        du temps de la classe.
                        La partie administrateur, elle, permettait de g&eacute;rer les utilisateurs ainsi que les messages du chat.
                    </p>
                    <p>
                        &Agrave; l&apos;&eacute;poque, je ne connaissais pas encore le hashage de mot de passe, donc les mots de passe
                        &eacute;taient stock&eacute;s en clair dans la base de donn&eacute;es, ce que je ne ferais plus aujourd&apos;hui.
                    </p>
                    <p>
                        Ce site m&apos;a appris pas mal de choses, notamment le <b>PHP</b>, la gestion d&apos;une base de donn&eacute;es
                        <b>MySQL</b>, mais aussi la gestion d&apos;un serveur <b>Apache</b>. C&apos;est notamment apr&egrave;s ce projet
                        que j&apos;ai d&eacute;couvert le hashage de mot de passe.
                    </p>
                </div>
            </div>
            <div class="galettes">
                <h2>Un site web pour commander des galettes</h2>
                <div>
                    <h3 class="langages">
                        Ce site web &eacute;tait produit en PHP, int&eacute;ragissant avec une base de donn&eacute;es MySQL.
                    </h3>
                    <p>
                        Dans le cadre d&apos;un projet personnel, j&apos;ai d&eacute;cid&eacute; de cr&eacute;er un site web
                        pour permettre de commander des galettes de fa&ccedil;on &agrave; passer et prendre en compte les
                        commandes plus simplement et plus rapidement.
                    </p>
                    <p>
                        Il y a donc une page pour les &#8220;d&eacute;gustateurs&#8221; (pour commander), ainsi qu&apos;une page
                        pour le &#8220;cuisinier&#8221; (pour voir les commandes et les pr&eacute;parer). Depuis l&apos;interface
                        des d&eacute;gustateurs, il est possible de mettre &agrave; jour sa commande en cas d&apos;erreur.
                    </p>
                    <p>
                        Je l&apos;ai aujourd&apos;hui pass&eacute; sous Docker pour permettre une installation plus simple et
                        plus rapide.
                    </p>
                    <p>
                        Ce projet m&apos;as permis d&apos;apprendre les bases du <b>PHP</b>, de la gestion d&apos;une base de donn&eacute;es
                        <b>MySQL</b>, l&apos;installation d&apos;un serveur <b>Apache</b>, mais surtout, la base de <b>Docker</b>.
                    </p>
                </div>
            </div>
            <div class="spacey">
                <h2>SpaceY</h2>
                <div>
                    <h3 class="langages">
                        Ce site web &eacute;tait produit en HTML pure, CSS et JavaScript.
                    </h3>
                    <p>
                        Dans le cadre d&apos;un projet scolaire, j&apos;ai d&eacute;cid&eacute; de cr&eacute;er un site web
                        sur un sujet scientifique au choix. J&apos;ai bien entendu parl&eacute; de ma passion, l&apos;espace.
                    </p>
                    <p>
                        Ce site web &eacute;tait compos&eacute; d&apos;une seule page avec deux sections. Il y avait
                        une section sur les plan&egrave;tes telluriques et une autre sur les plan&egrave;tes gazeuses.
                    </p>
                    <p>
                        J&apos;ai int&eacute;gr&eacute; un syst&egrave;me de vue 3D des plan&egrave;tes (avec Model-Viewer).
                        Chaque section comportait le nom de la plan&egrave;te, une repr&eacute;sentation 3D ainsi qu&apos;un
                        texte explicatif.
                    </p>
                    <p>
                        La partie de la description des plan&egrave;tes pouvait &ecirc;tre cach&eacute;e ou affich&eacute;e
                        par un simple clic sur la bo&icirc;te de la plan&egrave;te. Celui-ci par contre est toujours
                        disponnible en cliquant <a href="https://replit.com/@NathanBoga/SpaceY" target="_blank">ici</a>.
                    </p>
                    <p>
                        Ce projet m&apos;a permis de d&eacute;couvrir le <b>Model-Viewer</b> de Google, et donc
                        l&apos;int&eacute;gration de <b>modules JavaScript</b> dans une page web. Pour ce site web et
                        sa pr&eacute;sentation, j&apos;ai obtenu la note de <b>20/20</b>.
                    </p>
                </div>
            </div>
        </section>
    </main>
    <footer>
        <p>Nathan Boga - Juillet 2024</p>
    </footer>
    <div id="arrow" class="arrow"><img src="./img/arrow.svg" alt="^"></div>
</body>
</html>